In [75]:
import pandas as pd
import numpy as np

In [76]:
data = pd.read_csv(r"C:\Users\user\OneDrive\Desktop\Student_details2.csv")

In [77]:
print(data)

   enrollment_no    name   age branch      fees
0        ENR1000   Sneha  23.0     ME   57094.0
1        ENR1001   Tejas  20.0     CE   83489.0
2        ENR1002     NaN  24.0    CSE   72406.0
3        ENR1003  Sahana  22.0    ECE   64116.0
4        ENR1004   Sneha  19.0    CSE  114277.0
..           ...     ...   ...    ...       ...
95       ENR1095    Diya  19.0    ECE   60034.0
96       ENR1096   Nisha  24.0     CE  116490.0
97       ENR1097   Aarav  25.0    ECE   84118.0
98       ENR1098  Ananya  20.0     IT  115631.0
99       ENR1099   Rohan  19.0     ME   70579.0

[100 rows x 5 columns]

In [78]:
data.head(5)

  enrollment_no    name   age branch      fees
0       ENR1000   Sneha  23.0     ME   57094.0
1       ENR1001   Tejas  20.0     CE   83489.0
2       ENR1002     NaN  24.0    CSE   72406.0
3       ENR1003  Sahana  22.0    ECE   64116.0
4       ENR1004   Sneha  19.0    CSE  114277.0

In [79]:
data.info()

<class 'pandas.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   enrollment_no  100 non-null    str
 1   name           87 non-null     str
 2   age            91 non-null     float64
 3   branch         86 non-null     str
 4   fees           93 non-null     float64
dtypes: float64(2), str(3)
memory usage: 5.4 KB

In [80]:
data.shape

(100, 5)

In [81]:
data.isnull().sum()

enrollment_no     0
name             13
age               9
branch           14
fees              7
dtype: int64

In [82]:
data.duplicated().sum()

np.int64(0)

In [83]:
data.dtypes

enrollment_no        str
name                 str
age              float64
branch               str
fees             float64
dtype: object

In [84]:
data.describe()

             age          fees
count  91.000000      93.00000
mean   21.373626   79765.16129
std     2.336419   26367.89656
min    18.000000   31800.00000
25%    19.000000   57094.00000
50%    21.000000   80864.00000
75%    23.000000  105454.00000
max    25.000000  119814.00000

In [ ]:
# Remove duplicates

In [85]:
data= data.drop_duplicates()

In [ ]:
# Handle missing Values

In [86]:
data.fillna({
    'name': 'Unknown',  # fill name with a string
    'age': data['age'].mean(),  # fill age with its mean
    'branch': 'Not Specified',  # fill branch with a string
    'fees': 0  # fill fees with zero
}, inplace=True)

   enrollment_no     name   age branch      fees
0        ENR1000    Sneha  23.0     ME   57094.0
1        ENR1001    Tejas  20.0     CE   83489.0
2        ENR1002  Unknown  24.0    CSE   72406.0
3        ENR1003   Sahana  22.0    ECE   64116.0
4        ENR1004    Sneha  19.0    CSE  114277.0
..           ...      ...   ...    ...       ...
95       ENR1095     Diya  19.0    ECE   60034.0
96       ENR1096    Nisha  24.0     CE  116490.0
97       ENR1097    Aarav  25.0    ECE   84118.0
98       ENR1098   Ananya  20.0     IT  115631.0
99       ENR1099    Rohan  19.0     ME   70579.0

[100 rows x 5 columns]